const questions = [

/* =========================
D / C 행동형 vs 창작형
========================= */

{
question:"서버 플레이에 있어 어떤 사람이 되고 싶나요?",
answers:[
{text:" 무언가를 만들거나, 그 자원을 생산하는 등 서버의 필수적인 기반이 되고 싶다",type:"D"},
{text:"사람들에게 나의 생각과 창의성을 알리고 싶다",type:"C"}
]
},

{
question:"어떤 플레이 스타일이 본인과 가깝나요?",
answers:[
{text:"활동적으로 움직이는 스타일",type:"D"},
{text:"생각하면서 가만히 스타일",type:"C"}
]
},


{
question:"도스온라인 플레이 중, 특수한 상황이 벌어졌을 때, 당신의 대처에 가까운 것은?",
answers:[
{text:"신경쓰지 않는다, 아까 심어놓은 감자를 수확하러 간다",type:"D"},
{text:"당장 스크린샷을 찍고, 카페에 글이나 사진을 올리러 간다",type:"C"}
]
},

{
question:"길에 불이 나거나 쓰레기가 버려져 있는 것을 발견한 당신은 어떤 선택을 하겠습니까",
answers:[
{text:"내가 소방관이나 환경미화원으로 직업을 변경해서 직접 치우겠다",type:"D"},
{text:"앗, 이 불/쓰레기를 보니 새로운 영감이 떠올랐다!",type:"C"}
]
},

{
question:"새로운 프로젝트를 시작할 때 당신의 첫 행동은?",
answers:[
{text:"필요한 장비와 재료를 신속하게 챙겨 즉시 실행한다",type:"D"},
{text:"메모장을 켜거나 기발한 아이디어를 먼저 구상한다",type:"C"}
]
},

/* =========================
P / S 교류형 vs 독립형
========================= */


{
question:"도스온라인을 플레이하면서 가장 즐거운 순간은?",
answers:[
{text:"사람들과 소통하면서 놀 때",type:"P"},
{text:"혼자 목표를 달성했을 때",type:"S"}
]
},

{
question:"도스온라인에서 이루고 싶은 것은?",
answers:[
{text:"사람들과 친해지기",type:"P"},
{text:"개인의 성장",type:"S"}
]
},

{
question:"도드랑거리 버스킹을 갈 때",
answers:[
{text:"친구들과 같이 가는 것을 좋아한다",type:"P"},
{text:"혼자서 가는 걸 좋아한다",type:"S"}
]
},

{
question:"도스고등학교 생활할 때 어떤 학생이었나요?",
answers:[
{text:"다른 학생들과 어울리며 졸업했다",type:"P"},
{text:"조용히 출석을 받고 졸업했다",type:"S"}
]
},

{
question:"핫타임 추첨에서 고가의 아이템이 당첨되었다면?",
answers:[
{text:"다른 사람들에게 자랑한다",type:"P"},
{text:"자랑하지 않고 가지고 있는다",type:"S"}
]
},




// =========================
// R / A 도전형 vs 안정형
// 17~24번
// =========================

{
question:"어떤 방식으로 돈을 벌고 싶나요?",
answers:[
{text:"인생은 한 방",type:"R"},
{text:"꾸준한 저축",type:"A"}
]
},

{
question:"자신의 기업에 어떤 사람을 채용하고 싶나요?",
answers:[
{text:"성장형 뉴비",type:"R"},
{text:"안정적인 경력자",type:"A"}
]
},

{
question:"핫타임 중 하나만 받을 수 있다면 무엇을 받고 싶나요?",
answers:[
{text:"10% 확률로 1억 원",type:"R"},
{text:"1,000만 원",type:"A"}
]
},

{
question:"둘 중 더 하고 싶은 직업은?",
answers:[
{text:"본인 성과에 따라 수익이 결정되는 크루원",type:"R"},
{text:"안정적인 월급과 인센티브의 공무원",type:"A"}
]
},

{
question:"현재 소지금은 천만 원, 처음 보는 딜러에게 당신의 결정은?",
answers:[
{text:"천만 원을 넣는다",type:"R"},
{text:"100만 원만 넣어본다",type:"A"}
]
},

// =========================
// F / T 자유형 vs 성장형
// 25~32번
// =========================

{
question:"어떤 플레이 방식을 좋아하나요?",
answers:[
{text:"자유롭게 즐기는 스타일",type:"F"},
{text:"한 분야의 정점을 찍는 꾸준한 스타일",type:"T"}
]
},

{
question:"갑자기 시간이 생겼을 때 나는?",
answers:[
{text:"서버 곳곳 돌아다니며 구경한다",type:"F"},
{text:"광질이나 농사하며 성장한다",type:"T"}
]
},

{
question:"원래 하던 일이 질렸을 때 어떻게 할 건가요?",
answers:[
{text:"미련 없이 새로운 일을 찾아 즉시 전환한다",type:"F"},
{text:"목표를 위해 끈기 있게 게속 한다",type:"T"}
]
},

{
question:"도스온라인에 처음 접속한 당신이 가장 먼저 할 행동은?",
answers:[
{text:"그날그날 눈에 띄거나 하고 싶은 일부터 발길 닿는 대로 시작한다",type:"F"},
{text:"튜토리얼부터 차근차근 해결한다",type:"T"}
]
},

{
question:"마지막 질문! 나에게 가장 가까운 말은?",
answers:[
{text:"나는 자유로운 모험가다",type:"F"},
{text:"나는 목표를 이루는 사람이다",type:"T"}
]
}

];